---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericRefractionIndex
source: html/c4b4f557-5eb8-b23f-807a-5b7a38620a05.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericRefractionIndex Property

The property labeled "Refraction" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericRefractionIndex { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0.01, 5".